updated the readme file
